In [1]:
import pandas as pd
flights_df = pd.read_csv('../data/flights.csv')

In [3]:
flights_df.head()

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
0,2013,1,1,517.0,515,2.0,830.0,819,11.0,UA,1545,N14228,EWR,IAH,227.0,1400,5,15,2013-01-01 05:00:00
1,2013,1,1,533.0,529,4.0,850.0,830,20.0,UA,1714,N24211,LGA,IAH,227.0,1416,5,29,2013-01-01 05:00:00
2,2013,1,1,542.0,540,2.0,923.0,850,33.0,AA,1141,N619AA,JFK,MIA,160.0,1089,5,40,2013-01-01 05:00:00
3,2013,1,1,544.0,545,-1.0,1004.0,1022,-18.0,B6,725,N804JB,JFK,BQN,183.0,1576,5,45,2013-01-01 05:00:00
4,2013,1,1,554.0,600,-6.0,812.0,837,-25.0,DL,461,N668DN,LGA,ATL,116.0,762,6,0,2013-01-01 06:00:00

In [4]:
#summarize a single column within a dataframe
flights_df['distance'].sum()

350217607

In [5]:
flights_df['distance'].mean()

1039.9126036297123

In [6]:
flights_df['distance'].median()

872.0

In [7]:
flights_df['distance'].mode()

0    2475
dtype: int64

In [11]:
flights_df['carrier'].value_counts()

UA    58665
B6    54635
EV    54173
DL    48110
AA    32729
MQ    26397
US    20536
9E    18460
WN    12275
VX     5162
FL     3260
AS      714
F9      685
YV      601
HA      342
OO       32
Name: carrier, dtype: int64

In [12]:
#mean delay in departure
flights_df['dep_delay'].mean()

12.639070257304708

In [15]:
#distinct number of carriers
#hint: find a method to find the number of unique values in a series
#unique values in an array below
flights_df['carrier'].unique()

array(['UA', 'AA', 'B6', 'DL', 'EV', 'MQ', 'US', 'WN', 'VX', 'FL', 'AS',
       '9E', 'F9', 'HA', 'YV', 'OO'], dtype=object)

In [16]:
#size of the unique values array
flights_df['carrier'].unique().size

16

In [17]:
#all in one step
flights_df['carrier'].nunique()

16

In [18]:
#describe gives mean, std, min, plus some quantile values
#for int fields
flights_df['distance'].describe()

count    336776.000000
mean       1039.912604
std         733.233033
min          17.000000
25%         502.000000
50%         872.000000
75%        1389.000000
max        4983.000000
Name: distance, dtype: float64

In [19]:
#describe gives unique count, top, frequency
#for object fields
flights_df['carrier'].describe()

count     336776
unique        16
top           UA
freq       58665
Name: carrier, dtype: object

In [21]:
#subset of dataframe columns
#double brackets
flights_df[['sched_dep_time', 'dep_time']]

        sched_dep_time  dep_time
0                  515     517.0
1                  529     533.0
2                  540     542.0
3                  545     544.0
4                  600     554.0
...                ...       ...
336771            1455       NaN
336772            2200       NaN
336773            1210       NaN
336774            1159       NaN
336775             840       NaN

[336776 rows x 2 columns]

In [22]:
#returns a series with just the columns we asked for
#applies summary function to both
flights_df[['sched_dep_time', 'dep_time']].mean()

sched_dep_time    1344.254840
dep_time          1349.109947
dtype: float64

In [23]:
#see... it's a series
type(flights_df[['sched_dep_time', 'dep_time']].mean())

pandas.core.series.Series

In [28]:
#if you want a dataframe as the output instead of a series...
#use the agg() method instead
#curly brackets, like we're working with a dictionary
#set up with key value pairs
flights_df.agg({
    'sched_dep_time' : ['mean', 'median'],
    'dep_time' : ['mean', 'min']
})

        sched_dep_time     dep_time
mean        1344.25484  1349.109947
median      1359.00000          NaN
min                NaN     1.000000

In [29]:
#what class of object does this return?
flights_df[['air_time', 'distance']].mean()

air_time     150.686460
distance    1039.912604
dtype: float64

In [30]:
#it's a series
type(flights_df[['air_time', 'distance']].mean())

pandas.core.series.Series

In [31]:
#what class of object does this return?
flights_df.agg({
    'air_time': ['mean'],
    'distance': ['mean']
})

       air_time     distance
mean  150.68646  1039.912604

In [32]:
#it's a data frame since it uses the agg() method
type(flights_df.agg({
    'air_time': ['mean'],
    'distance': ['mean']
}))

pandas.core.frame.DataFrame

In [33]:
#Fill in the blanks in the below code 
#to calculate the minimum and maximum distances traveled 
#and the mean and median arrival delay:

flights_df.agg({
    'distance': ['min', 'max'],
    'arr_delay': ['mean', 'median']
})

        distance  arr_delay
max       4983.0        NaN
mean         NaN   6.895377
median       NaN  -5.000000
min         17.0        NaN

In [34]:
#you can describe a whole dataframe
#this only describes the int/float columns, not the object/string fields
flights_df.describe()

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,flight,air_time,distance,hour,minute
count,336776.0,336776.000000,336776.000000,328521.000000,336776.000000,328521.000000,328063.000000,336776.000000,327346.000000,336776.000000,327346.000000,336776.000000,336776.000000,336776.000000
mean,2013.0,6.548510,15.710787,1349.109947,1344.254840,12.639070,1502.054999,1536.380220,6.895377,1971.923620,150.686460,1039.912604,13.180247,26.230100
std,0.0,3.414457,8.768607,488.281791,467.335756,40.210061,533.264132,497.457142,44.633292,1632.471938,93.688305,733.233033,4.661316,19.300846
min,2013.0,1.000000,1.000000,1.000000,106.000000,-43.000000,1.000000,1.000000,-86.000000,1.000000,20.000000,17.000000,1.000000,0.000000
25%,2013.0,4.000000,8.000000,907.000000,906.000000,-5.000000,1104.000000,1124.000000,-17.000000,553.000000,82.000000,502.000000,9.000000,8.000000
50%,2013.0,7.000000,16.000000,1401.000000,1359.000000,-2.000000,1535.000000,1556.000000,-5.000000,1496.000000,129.000000,872.000000,13.000000,29.000000
75%,2013.0,10.000000,23.000000,1744.000000,1729.000000,11.000000,1940.000000,1945.000000,14.000000,3465.000000,192.000000,1389.000000,17.000000,44.000000
max,2013.0,12.000000,31.000000,2400.000000,2359.000000,1301.000000,2400.000000,2359.000000,1272.000000,8500.000000,695.000000,4983.000000,23.000000,59.000000

In [35]:
#explicitly define data types to include more types
#provides additional summary stats for extra data types
flights_df.describe(include = ['int', 'float', 'object'])

,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,origin,dest,air_time,time_hour
count,328521.000000,328521.000000,328063.000000,327346.000000,336776,334264,336776,336776,327346.000000,336776
unique,NaN,NaN,NaN,NaN,16,4043,3,105,NaN,6936
top,NaN,NaN,NaN,NaN,UA,N725MQ,EWR,ORD,NaN,2013-09-13 08:00:00
freq,NaN,NaN,NaN,NaN,58665,575,120835,17283,NaN,94
mean,1349.109947,12.639070,1502.054999,6.895377,NaN,NaN,NaN,NaN,150.686460,NaN
std,488.281791,40.210061,533.264132,44.633292,NaN,NaN,NaN,NaN,93.688305,NaN
min,1.000000,-43.000000,1.000000,-86.000000,NaN,NaN,NaN,NaN,20.000000,NaN
25%,907.000000,-5.000000,1104.000000,-17.000000,NaN,NaN,NaN,NaN,82.000000,NaN
50%,1401.000000,-2.000000,1535.000000,-5.000000,NaN,NaN,NaN,NaN,129.000000,NaN
75%,1744.000000,11.000000,1940.000000,14.000000,NaN,NaN,NaN,NaN,192.000000,NaN
max,2400.000000,1301.000000,2400.000000,1272.000000,NaN,NaN,NaN,NaN,695.000000,NaN

In [36]:
#build your own method to run against a series
def percent(series):
    return(series/series.sum()) * 100

In [37]:
#percent not in single quotes because it's custom and not built-in
flights_df.agg({
    'air_time': ['mean'],
    'distance': [percent]
})

         air_time  distance
         air_time   percent
mean    150.68646       NaN
0             NaN  0.000400
1             NaN  0.000404
2             NaN  0.000311
3             NaN  0.000450
...           ...       ...
336771        NaN  0.000061
336772        NaN  0.000057
336773        NaN  0.000218
336774        NaN  0.000120
336775        NaN  0.000123

[336777 rows x 2 columns]